In [21]:
from sqlalchemy import create_engine
from pyspark.sql import SparkSession
import pandas as pd

In [22]:
spark = SparkSession.builder\
        .appName('loader')\
        .getOrCreate()

In [23]:
df = spark.read.parquet('../../data/final/part-00000-a868eb3f-41a7-4a9b-b1c3-d8027fbc07ce-c000.snappy.parquet')
pandas_df = df.toPandas()
pandas_df

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2024,SE,FT,AI Engineer,202730,USD,202730,US,0,US,M
1,2024,SE,FT,AI Engineer,92118,USD,92118,US,0,US,M
2,2024,SE,FT,Data Engineer,130500,USD,130500,US,0,US,M
3,2024,SE,FT,Data Engineer,96000,USD,96000,US,0,US,M
4,2024,SE,FT,Machine Learning Engineer,190000,USD,190000,US,0,US,M
...,...,...,...,...,...,...,...,...,...,...,...
33063,2020,SE,FT,Data Scientist,412000,USD,412000,US,100,US,L
33064,2021,MI,FT,Principal Data Scientist,151000,USD,151000,US,100,US,L
33065,2020,EN,FT,Data Scientist,105000,USD,105000,US,100,US,S
33066,2020,EN,CT,Business Data Analyst,100000,USD,100000,US,100,US,L
33067,2021,SE,FT,Data Science Manager,7000000,INR,94665,IN,50,IN,L

In [24]:
engine= create_engine('postgresql://airflow:airflow@localhost:5432/airflow')

In [25]:
pandas_df.to_sql('job_data',engine,if_exists="replace",index=False)
print('data has been writted to postgresql')

data has been writted to postgresql